pwbf/RX64M_THULake/src/Version_control/mt.c

/*******************************************************************************
* File Name     : main.c
* Version       : 1.00
* Device(s)     : RX family
* Tool-Chain    : C/C++ Compiler Package for RX Family
* OS            :
* H/W Platform  : RX family board
* Description   :
* Operation     :
*
* Limitations   :
******************************************************************************/
/******************************************************************************
* History       : DD.MM.YYYY Version Description
*               : 2018.11.13 V1.00    First Release
*               :
*               :
******************************************************************************/

/******************************************************************************
Typedef definitions
******************************************************************************/
#define ETHERNET_FUNCTION_ENABLE 0

/******************************************************************************
Includes <System Includes> , "Project Includes"
******************************************************************************/
#include <stdio.h>
#include <string.h>
#include <stdbool.h>



#if ETHERNET_FUNCTION_ENABLE
/*For Ethernet*/
#include "r_t4_itcpip.h"
#include "r_sys_time_rx_if.h"
#include "echo_srv_sample.h"
#endif

/*For ADC*/
#include "platform.h"
#include "r_s12ad_rx_config.h"
#include "r_s12ad_rx_if.h"

/*For SCI*/
#include "r_sci_rx_if.h"        // The SCI module API interface file.
#include "r_byteq_if.h"         // The BYTEQ module API interface file.
#include "r_sci_rx_config.h"    // User configurable options for the SCI module

/******************************************************************************
Macro definitions
******************************************************************************/
#if ETHERNET_FUNCTION_ENABLE
#if (APPLICATION_T4_CHANNEL_NUM  == (2))
#define T4_WORK_SIZE (9112)  /* Maximum size used in echo server sample program */
#elif (APPLICATION_T4_CHANNEL_NUM == (1))
#define T4_WORK_SIZE (4412)  /* Maximum size used in echo server sample program */
#endif
#endif

/******************************************************************************
Imported global variables and functions (from other files)
******************************************************************************/
extern void echo_srv(void);

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/
void main(void);
void init_mtu0(void);   /*For ADC*/
void MyCallback(void *pArgs);   /*For ADC*/

/******************************************************************************
Private global variables and functions
******************************************************************************/
#if ETHERNET_FUNCTION_ENABLE
static UW tcpudp_work[T4_WORK_SIZE / 4 + 1];
#endif

/*For ADC.Begin*/
uint16_t  g_data0;  // Global variable for saving result of ADC CH0 conversions
uint16_t  g_data1;  // Global variable for saving result of ADC CH1 conversions
uint16_t  g_data2;  // Global variable for saving result of ADC CH2 conversions
uint16_t  g_data3;  // Global variable for saving result of ADC CH3 conversions
uint16_t  g_data;  // Global variable for saving result of ADC CH0 conversions
static void ADCInit(void);
static void ADCStart(void);
/*For ADC.End*/

/*For UART.Begin*/
void my_sci_callback(void *pArgs);
void my_sci_callback_ch1(void *pArgs);
void my_sci_callback_ch2(void *pArgs);
static void Rx64MInitPorts(void);
static void UARTInit(void);
static void SendADCValue(const uint16_t adc_value,int mode);
static void SendSCIVersion(void);

void U16toStr(uint16_t value, uint8_t *buff);
void HMI_n_value(uint8_t n_id,uint16_t n_value);
void HMI_z_value(uint8_t z_id,uint16_t z_value);
void delay1s(uint8_t tmp);
void HMI_page(uint8_t page_id);
/*for hmi test*/
uint8_t HexToChar_buff[4] = {0x00,0x00,0x00,0x00};
uint8_t HMI_page_order[10] = {0x70,0x61,0x67,0x65,0x20,0x30,0x30,0xff,0xff,0xff};
// uint8_t HMI_n_order[13] = {0x6E,0x30,0x2E,0x76,0x61,0x6C,0x3D,0x30,0x30,0x30,0xff,0xff,0xff};
// uint8_t HMI_z_order[13] = {0x7A,0x30,0x2E,0x76,0x61,0x6C,0x3D,0x30,0x30,0x30,0xff,0xff,0xff};
static const uint8_t HexChar[16] = {'0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F'};

/* Handle storage. Needs to persist as long as SCI calls are going to be made.*/
static sci_hdl_t   g_my_sci_handle;
static sci_hdl_t   g_my_sci_handle_ch1;	//For BT UART
static sci_hdl_t   g_my_sci_handle_ch2;	//For testing
/*For UART. End*/

/*Custome function declaration start*/
void chtx(float val_data, int mode);
void zxclac(float val_data, int mode);
void chzx(float val_data, int mode);
int dp_count(float val);
void bt_string(float val, int mode);
void bt_send(void);
/*Custome function declaration end*/

/*Custome global variable declaration start*/
int refresh_delay=1000;
float global_f1_temp=0;			//p40
float global_f1_humi=0;			//p41
float global_f1_phph=0;			//p42
float global_env_temp=0;		//p
float global_env_humi=0;		//p
float global_env_illu=0;		//p43

float global_f1_temp_adj=-15;			//adjust field 1 temperature
float global_f1_humi_adj=+40;			//adjust field 1 humidity
float global_f1_phph_adj=-1.1;			//adjust field 1 ph
float global_env_temp_adj=0;			//adjust enviroment temperature
float global_env_humi_adj=0;			//adjust enviroment humidity
float global_env_illu_adj=0;			//adjust enviroment illumination

uint8_t bt_str_send[24];
	uint8_t f1t[4]={'0','0','.','0'};			//10 Field 1 temperature value			[xx.x]
	uint8_t f1h[3]={'0','0','0'};				//11 Field 1 humidity value				[xxx]
	uint8_t f1p[4]={'0','0','.','0'};			//12 Field 1 ph value					[xx.x]
	uint8_t evt[4]={'0','0','.','0'};			//100 Enviroment temperature value		[xx.x]
	uint8_t evh[3]={'0','0','0'};				//101 Enviroment humidity value			[xxx]
	uint8_t evi[6]={'0','0','0','0','.','0'};	//103 Enviroment illumination value		[xxxx.x]
/*Custome global variable declaration end*/

