pwbf/RX64M_THULake/src/Version_control/mt.c
/******************************************************************************
* Function Name : main
* Declaration   : void main(void)
* Description   : This function is main processing
* Arguments     : none
* Return value  : none
******************************************************************************/

void main(void){
    Rx64MInitPorts();
    UARTInit();
	ADCInit();		
	ADCStart();
#if 0
    sci_err_t   my_sci_err;
        /* Wait to get a character from the terminal so we know that it is ready. */
        do{
			my_sci_err = R_SCI_Receive(g_my_sci_handle, &my_char, 1);
        } while (SCI_ERR_INSUFFICIENT_DATA == my_sci_err);
#endif
	
    while (1){
		global_f1_temp=0.0171*g_data0+global_f1_temp_adj;
		
		global_f1_humi=0.0244*g_data1+global_f1_humi_adj;
		if(global_f1_humi>=100)
			global_f1_humi=100;
		
		global_f1_phph=0.0034*g_data2+global_f1_phph_adj;
		
		global_env_illu=0.3663*g_data3+global_env_illu_adj;
		
		/*For Field 1*/
			bt_string(global_f1_temp, 10);
		// delay1s(refresh_delay);
			chtx(global_f1_temp,10);
		delay1s(refresh_delay);
			zxclac(global_f1_temp,10);
		delay1s(refresh_delay);
		
			bt_string(global_f1_humi, 11);
		// delay1s(refresh_delay);
			chtx(global_f1_humi,11);
		delay1s(refresh_delay);
			zxclac(global_f1_humi,11);
		delay1s(refresh_delay);
		
			bt_string(global_f1_phph, 12);
			chtx(global_f1_phph,12);
		delay1s(refresh_delay);
			zxclac(global_f1_phph,12);
		delay1s(refresh_delay);
		
		
		/*For Enviroment*/
			bt_string(global_env_temp, 100);
			chtx(global_env_temp,100);
		delay1s(refresh_delay);
			zxclac(global_env_temp,100);
		delay1s(refresh_delay);
			
			bt_string(global_env_humi, 101);
			chtx(global_env_humi,101);
		delay1s(refresh_delay);
			zxclac(global_env_humi,101);
		delay1s(refresh_delay);
			
			bt_string(global_env_illu, 103);
			chtx(global_env_illu,103);
		delay1s(refresh_delay);
			zxclac(global_env_illu,103);
		delay1s(refresh_delay);
		
		bt_send();
    }

}

/**
	Mode explained:
	mode = ab
	a: field number(1~5,10)
	b: data symble(1~4)
		0: temperature
		1: humidity
		2: ph
		3: illumination
**/
void bt_string(float val, int mode){
	switch(mode){
		case 10:
			if(val<10)
				sprintf(f1t,"0%.1f",val);
			else
				sprintf(f1t,"%.1f",val);
			break;
		case 11:
			if(val<10)
				sprintf(f1h,"00%.0f",val);
			else if(val>=10 && val<100)
				sprintf(f1h,"0%.0f",val);
			else
				sprintf(f1h,"%.0f",val);
			break;
		case 12:
			if(val<10)
				sprintf(f1p,"0%.1f",val);
			else
				sprintf(f1p,"%.1f",val);
			break;		
		case 100:
			if(val<10)
				sprintf(evt,"0%.1f",val);
			else
				sprintf(evt,"%.1f",val);
			break;
		case 101:
			if(val<10)
				sprintf(evh,"00%.0f",val);
			else if(val>=10 && val<100)
				sprintf(evh,"0%.0f",val);
			else
				sprintf(evh,"%.0f",val);
			break;
		case 103:
			if(val<10)
				sprintf(evi,"000%.1f",val);
			else if(val>=10 && val<100)
				sprintf(evi,"00%.1f",val);
			else if(val>=100 && val<1000)
				sprintf(evi,"0%.1f",val);
			else
				sprintf(evi,"%.1f",val);
			break;
		default:
			nop();		
	}
}

void bt_send(void){
	sprintf(bt_str_send,"%s%s%s%s%s%s\n",f1t,f1h,f1p,evt,evh,evi);		
	R_SCI_Send(g_my_sci_handle_ch1,bt_str_send,24);
}

int dp_count(float val){
	int order = 1;
	while(val>=10){
		val /= 10;
		order++;
	}
	return order;
}

/**	change t?.txt on screen			
	data_pre_count: xxx.x =3; xx.x=2 	
	array length = data_pre_count+14	
	mode=t?.txt						
	t0= temperature		(0)c			
	t1= humidity		(1)%			
	t2= pH				(2) 
	t3= illumination	(3)w/m2				**/

void chtx(float val_data, int mode){
	int data_pre_count = dp_count(val_data);
	uint8_t cmd_send[20];
	if(mode<100){
		if(mode==1){
			sprintf(cmd_send,"t%d.txt=\"%.0f%\"",mode,val_data);
			cmd_send[14+data_pre_count-3]=0xff;
			cmd_send[14+data_pre_count-2]=0xff;
			cmd_send[14+data_pre_count-1]=0xff;
			R_SCI_Send(g_my_sci_handle,cmd_send,14+data_pre_count);
		}
		else{
			sprintf(cmd_send,"t%d.txt=\"%.1f\"",mode,val_data);
			cmd_send[15+data_pre_count-3]=0xff;
			cmd_send[15+data_pre_count-2]=0xff;
			cmd_send[15+data_pre_count-1]=0xff;
			R_SCI_Send(g_my_sci_handle,cmd_send,15+data_pre_count);
		}
	}
	else {
		if(mode==1){
			sprintf(cmd_send,"t%d.txt=\"%.0f%\"",mode,val_data);
			cmd_send[15+data_pre_count-3]=0xff;
			cmd_send[15+data_pre_count-2]=0xff;
			cmd_send[15+data_pre_count-1]=0xff;
			R_SCI_Send(g_my_sci_handle,cmd_send,15+data_pre_count);
		}
		else{
			sprintf(cmd_send,"t%d.txt=\"%.1f\"",mode,val_data);
			cmd_send[16+data_pre_count-3]=0xff;
			cmd_send[16+data_pre_count-2]=0xff;
			cmd_send[16+data_pre_count-1]=0xff;
			R_SCI_Send(g_my_sci_handle,cmd_send,16+data_pre_count);
		}
	}
}

void zxclac(float val_data, int mode){
	switch(mode){
		case 10:
			if(3*val_data>180){
				val_data=180;
				chzx(val_data,mode);
			}
			else{
				chzx(3*val_data,mode);
			}
			break;
		case 11:
			chzx(1.8*val_data,mode);
			break;
		case 12:
			if(val_data<4){
				val_data=0;
				chzx(val_data,mode);
			}
			else if(val_data>10){
				val_data=180;
				chzx(val_data,mode);
			}
			else{
				chzx(30*val_data-120,mode);
			}
			break;
		case 100:
			chzx(0.12*val_data,mode);
			break;
		case 101:
			chzx(0.12*val_data,mode);
			break;
		case 103:
			chzx(0.12*val_data,mode);
			break;
		default:
			chzx(270,0);
			chzx(270,1);
			chzx(270,2);
			chzx(270,3);
			chtx(999,0);
			chtx(999,1);
			chtx(999,2);
			chtx(999,3);
	}
}

void chzx(float angle, int tag_id){
	uint8_t cmd_send[20];
	sprintf(cmd_send,"z%d.val=%.0f",tag_id,angle);
	if(tag_id<100){
		if(angle<10){
			cmd_send[11]=0xff;
			cmd_send[10]=0xff;
			cmd_send[9]=0xff;
			R_SCI_Send(g_my_sci_handle,cmd_send,12);
		}
		else if(10<=angle && angle<100){
			cmd_send[12]=0xff;
			cmd_send[11]=0xff;
			cmd_send[10]=0xff;
			R_SCI_Send(g_my_sci_handle,cmd_send,13);
		} 
		else if(100<=angle){
			cmd_send[13]=0xff;
			cmd_send[12]=0xff;
			cmd_send[11]=0xff;
			R_SCI_Send(g_my_sci_handle,cmd_send,14);
		}
	}
	else {
		if(angle<10){
			cmd_send[12]=0xff;
			cmd_send[11]=0xff;
			cmd_send[10]=0xff;
			R_SCI_Send(g_my_sci_handle,cmd_send,13);
		}
		else if(10<=angle && angle<100){
			cmd_send[13]=0xff;
			cmd_send[12]=0xff;
			cmd_send[11]=0xff;
			R_SCI_Send(g_my_sci_handle,cmd_send,14);
		} 
		else if(100<=angle){
			cmd_send[14]=0xff;
			cmd_send[13]=0xff;
			cmd_send[12]=0xff;
			R_SCI_Send(g_my_sci_handle,cmd_send,15);
		}
	}
}
/*****************************************************************************/
/*Functions for . Begin*/
/*****************************************************************************/

