pwbf/RX64M_THULake/src/Version_control/mt.c
	/*Send data to screen at P90*/
	/*For SCI-UART_ch7*/
        /* Set TXD7 pin */  /*P90*/
        PORT9.PODR.BYTE |= 0x01;
        MPC.P90PFS.BYTE = 0x0A;
        PORT9.PMR.BYTE |= 0x01;  // Set P90 mode to peripheral operation
        PORT9.PDR.BYTE |= 0x01;
	
	/*For SCI-UART_ch1*/ /*For Bluetooth addon*/
        /* Set RXD1 pin */  /*P15*/
        MPC.P15PFS.BYTE = 0x0A;
        PORT1.PMR.BYTE |= 0x20;    // Set P21 mode to peripheral operation

        /* Set TXD1 pin */  /*P26*/
        PORT2.PODR.BYTE |= 0x40;
        MPC.P26PFS.BYTE = 0x0A;
        PORT2.PMR.BYTE |= 0x40;  // Set P26 mode to peripheral operation
        PORT2.PDR.BYTE |= 0x40;

    /*For ADC*/
		
		/*Setting for P40 as AN000*/
        MPC.P40PFS.BYTE = 0x80;     // Pin Func Select P40 AN000; POT on
        PORT4.PDR.BIT.B0 = 0;       // set AN pin direction to input (default)
        PORT4.PMR.BIT.B0 = 1;       // set AN pin mode to peripheral
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC); // Re-lock the MPC register.
		
		/*Setting for P41 as AN001*/
        MPC.P40PFS.BYTE = 0x80;     // Pin Func Select P41 AN001; POT on
        PORT4.PDR.BIT.B1 = 0;       // set AN pin direction to input (default)
        PORT4.PMR.BIT.B1 = 1;       // set AN pin mode to peripheral
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC); // Re-lock the MPC register.
		
		/*Setting for P42 as AN002*/
        MPC.P40PFS.BYTE = 0x80;     // Pin Func Select P42 AN002; POT on
        PORT4.PDR.BIT.B2 = 0;       // set AN pin direction to input (default)
        PORT4.PMR.BIT.B2 = 1;       // set AN pin mode to peripheral
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC); // Re-lock the MPC register.
		
		/*Setting for P43 as AN003*/
        MPC.P40PFS.BYTE = 0x80;     // Pin Func Select P43 AN003; POT on
        PORT4.PDR.BIT.B3 = 0;       // set AN pin direction to input (default)
        PORT4.PMR.BIT.B3 = 1;       // set AN pin mode to peripheral
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC); // Re-lock the MPC register.

        /*Setting for P44 as AN004*/
        MPC.P44PFS.BYTE = 0x80;     // Pin Func Select P44 AN004; POT on
        PORT4.PDR.BIT.B4 = 0;       // set AN pin direction to input (default)
        PORT4.PMR.BIT.B4 = 1;       // set AN pin mode to peripheral
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC); // Re-lock the MPC register.
		
        return;
}




